; GeoscApps HUD enhancements Part #2 (WotC)
;-----------------------------------------------------------------------------
; Bonus/Symbols shown in each corresponding ToolTips via direct HTML swappIns!
; *** <img src='img:///GeoscApps_P2_UILibrary.???' width='48' height='48' vspace='-24'>
;-----------------------------------------------------------------------------

[ResCard_MunitionsExperts X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC01_MunitionsExperts' width='48' height='48' vspace='-24'> Munitions Experts"
SummaryText="\nExperimental Ammo projects in the Proving Grounds are completed instantly."

[ResCard_LiveFireTraining X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC02_LiveFireTraining' width='48' height='48' vspace='-24'> Live Fire Training"
SummaryText="\nAny recruits training in the GTS will achieve the rank of Sergeant."

[ResCard_VolunteerArmy X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC03_VolunteerArmy' width='48' height='48' vspace='-24'> Volunteer Army"
SummaryText="\nOn every mission, there is a chance that a Resistance soldier will join the XCOM squad."

[ResCard_RapidCollection X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC04_RapidCollection' width='48' height='48' vspace='-24'> Rapid Collection"
SummaryText="\nResistance supply drops are collected instantly."

[ResCard_ResistanceNetwork X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC05_ResistanceNetwork' width='48' height='48' vspace='-24'> Resistance Network"
SummaryText="\nContact with new regions is made instantly."

[ResCard_BombSquad X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC06_BombSquad' width='48' height='48' vspace='-24'> Bomb Squad"
SummaryText="\nExperimental Grenade and Heavy Weapon projects are completed instantly in the Proving Grounds."

[ResCard_IntegratedWarfare X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC07_IntegratedWarfare' width='48' height='48' vspace='-24'> Integrated Warfare"
SummaryText="\nAll PCS effects are increased."

[ResCard_InsideKnowledge X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC08_InsideKnowledge' width='48' height='48' vspace='-24'> Inside Knowledge"
SummaryText="\nThe effect of all weapon modifications is increased."

[ResCard_DoubleAgent X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC09_DoubleAgent' width='48' height='48' vspace='-24'> Double Agent"
SummaryText="\nOn every mission, there is a chance that an ADVENT unit will join the XCOM squad."

[ResCard_TacticalAnalysis X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC10_TacticalAnalysis' width='48' height='48' vspace='-24'> Tactical Analysis"
SummaryText="\nEnemy units lose one action on their next turn if discovered on the XCOM turn."

[ResCard_SuitUp X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC11_SuitUp' width='48' height='48' vspace='-24'> Suit Up"
SummaryText="\nAll armor and vest projects in the Proving Ground are completed instantly."

[ResCard_GreaterResolve X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC12_GreaterResolve' width='48' height='48' vspace='-24'> Greater Resolve"
SummaryText="\nLightly wounded soldiers can be sent into combat."

[ResCard_MentalFortitude X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC13_MentalFortitude' width='48' height='48' vspace='-24'> Mental Fortitude"
SummaryText="\nAll battle madness (panic, obsession, berserk, shattered) only lasts one turn."

[ResCard_PursuitOfKnowledge X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC14_PursuitOfKnowledge' width='48' height='48' vspace='-24'> Pursuit of Knowledge"
SummaryText="\nLaboratory facilities provide an additional <XGParam:IntValue0/>% boost to research times."

[ResCard_MachineLearning X2StrategyCardTemplate]
DisplayName="<img src='img:///GeoscApps_P2_UILibrary.WC15_MachineLearning' width='48' height='48' vspace='-24'> Machine Learning"
SummaryText="\nResearch breakthroughs are twice as likely to occur."

;------------------------------------------------
; Colored Logos.. too! (Only through GFX sprites)
;------------------------------------------------

;[Continent_NorthAmerica X2ContinentTemplate]
;DisplayName="North America <img src='img:///GeoscApps_P2_UILibrary.CBLogo-NorthAmerica(80A)' width='64' height='64' vspace='-72'>"

;[Continent_SouthAmerica X2ContinentTemplate]
;DisplayName="South America <img src='img:///GeoscApps_P2_UILibrary.CBLogo-SouthAmerica(80A)' width='64' height='64' vspace='-72'>"

;[Continent_Europe X2ContinentTemplate]
;DisplayName="Europe <img src='img:///GeoscApps_P2_UILibrary.CBLogo-Europe(80A)' width='64' height='64' vspace='-72'>"

;[Continent_Asia X2ContinentTemplate]
;DisplayName="Asia <img src='img:///GeoscApps_P2_UILibrary.CBLogo-Asia(80A)' width='64' height='64' vspace='-72'>"

;[Continent_Africa X2ContinentTemplate]
;DisplayName="Africa <img src='img:///GeoscApps_P2_UILibrary.CBLogo-Africa(80A)' width='64' height='64' vspace='-72'>"

;[Continent_Oceania X2ContinentTemplate]
;DisplayName="Oceania <img src='img:///GeoscApps_P2_UILibrary.CBLogo-Oceania(80A)' width='64' height='64' vspace='-72'>"

;--------------------------------------------------
; If Continents can get some.. so does all Regions!
;--------------------------------------------------

[WorldRegion_EastNA X2WorldRegionTemplate]
DisplayName="Eastern<img src='img:///GeoscApps_P2_UILibrary.XC2_NA_EasternUS' width='32' height='32' vspace='-14'>U.S"

[WorldRegion_WestNA X2WorldRegionTemplate]
DisplayName="Western<img src='img:///GeoscApps_P2_UILibrary.XC2_NA_WesternUS' width='32' height='32' vspace='-14'>U.S"

[WorldRegion_SouthNA X2WorldRegionTemplate]
DisplayName="New<img src='img:///GeoscApps_P2_UILibrary.XC2_NA_NewMexico' width='32' height='32' vspace='-14'>Mexico"

[WorldRegion_NorthSA X2WorldRegionTemplate]
DisplayName="New<img src='img:///GeoscApps_P2_UILibrary.XC2_SA_NewBrazil' width='32' height='32' vspace='-14'>Brazil"

[WorldRegion_SouthSA X2WorldRegionTemplate]
DisplayName="New<img src='img:///GeoscApps_P2_UILibrary.XC2_SA_NewChile' width='32' height='32' vspace='-14'>Chile"

[WorldRegion_WestEU X2WorldRegionTemplate]
DisplayName="Western<img src='img:///GeoscApps_P2_UILibrary.XC2_EU_Western' width='32' height='32' vspace='-14'>Europe"

[WorldRegion_EastEU X2WorldRegionTemplate]
DisplayName="Eastern<img src='img:///GeoscApps_P2_UILibrary.XC2_EU_Eastern' width='32' height='32' vspace='-14'>Europe"

[WorldRegion_NorthAF X2WorldRegionTemplate]
DisplayName="West<img src='img:///GeoscApps_P2_UILibrary.XC2_AF_West' width='32' height='32' vspace='-14'>Africa"

[WorldRegion_EastAF X2WorldRegionTemplate]
DisplayName="East<img src='img:///GeoscApps_P2_UILibrary.XC2_AF_East' width='32' height='32' vspace='-14'>Africa"

[WorldRegion_SouthAF X2WorldRegionTemplate]
DisplayName="South<img src='img:///GeoscApps_P2_UILibrary.XC2_AF_South' width='32' height='32' vspace='-14'>Africa"

[WorldRegion_EastAS X2WorldRegionTemplate]
DisplayName="East<img src='img:///GeoscApps_P2_UILibrary.XC2_AS_East' width='32' height='32' vspace='-14'>Asia"

[WorldRegion_WestAS X2WorldRegionTemplate]
DisplayName="West<img src='img:///GeoscApps_P2_UILibrary.XC2_AS_West' width='32' height='32' vspace='-14'>Asia"

[WorldRegion_NorthAS X2WorldRegionTemplate]
DisplayName="New<img src='img:///GeoscApps_P2_UILibrary.XC2_AS_NewArctic' width='32' height='32' vspace='-14'>Arctic"

[WorldRegion_SouthAS X2WorldRegionTemplate]
DisplayName="New<img src='img:///GeoscApps_P2_UILibrary.XC2_AS_NewIndia' width='32' height='32' vspace='-14'>India"

[WorldRegion_NorthOC X2WorldRegionTemplate]
DisplayName="New<img src='img:///GeoscApps_P2_UILibrary.XC2_OC_NewIndonesia' width='32' height='32' vspace='-14'>Indonesia"

[WorldRegion_SouthOC X2WorldRegionTemplate]
DisplayName="New<img src='img:///GeoscApps_P2_UILibrary.XC2_OC_NewAustralia' width='32' height='32' vspace='-14'>Australia"
